// 80. Вывести на экран кодировку символов по ASCII(с 32 до 122)


for (char c = ' '; c <= 122; c++)
{
        System.Console.Write($"{c,2}");
}
