// 6. Написать программу вычисления значения функции y = sin(a). (Класс Math). 

Console.Write("Введите число: ");
double a= Convert.ToDouble(Console.ReadLine());
double y= Math.Sin(a);
System.Console.WriteLine(y);
